Revit 2027 API
FabricationConfiguration.UnloadItemFiles Method
 Unload the specified fabrication item files from the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UnloadItemFiles(
	IList<FabricationItemFile> itemFiles
)
Public Sub UnloadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
)
public:
void UnloadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
member UnloadItemFiles :
        itemFiles : IList<FabricationItemFile> -> unit
Parameters
itemFiles IList<FabricationItemFile>
 The fabrication item files to unload.
Exceptions
Exception | Condition
ArgumentException |  Fabrication item files can not be unloaded if they are currently in use. -or- Some fabrication item files have not been loaded.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace